app/views/comments/_comment.html.erb

INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "hello"], ["commenter", "Vincent"], ["created_at", "2014-04-30 05:12:31.266124"], ["updated_at", "2014-04-30 05:12:31.266124"]]
---
</p>
 <strong>Commented <%= time_ago_in_words(comment.created_at) %> ago by <%= comment.commenter %></strong>