app/views/articles/index.html.erb

<div id="sweetour">
&nbsp &nbsp &nbsp&nbsp &nbsp &nbsp&nbsp &nbsp &nbsp<%= link_to pluralize(article.sweets.count.to_s, "sweet")%> &nbsp |  &nbsp

<%= link_to pluralize(article.sours.count.to_s, "sour")%> &nbsp  | &nbsp
---
SELECT COUNT(*) FROM "sweets"  WHERE "sweets"."article_id" = ?  [["article_id", 2]]
SELECT COUNT(*) FROM "sours"  WHERE "sours"."article_id" = ?  [["article_id", 2]]