app/controllers/articles_controller.rb

def index
  @article = Article.new
  @articles = Article.all
---
SELECT "articles".* FROM "articles"   ORDER BY created_at desc

def create
  @article = Article.new(article_params)

  if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-04-29 01:58:55.297238"], ["text", "hello"], ["title", "Panget"], ["updated_at", "2014-04-29 01:58:55.297238"]]