app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 2], ["body", " panget nga niya"], ["commenter", "Vincent"], ["created_at", "2014-04-29 02:14:00.392513"], ["updated_at", "2014-04-29 02:14:00.392513"]]