app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2014-04-25 03:05:33.728803"], ["updated_at", "2014-04-25 03:05:33.728803"], ["username", "marian"]]