app/controllers/user_sessions_controller.rb

  def create
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'vincent' LIMIT 1